In [43]:
import pandas as pd

* Data Analysis
1. Description
2. Diagnosis
3. Prediction
4. Actions/Prescription

In [44]:
# The column names
cols = ['user_id','movie_id','rating','ts']

In [45]:
# Read the File
df = pd.read_csv('u.data',sep='\t',names=cols)

# comprehension

In [46]:
a = [4,8,2,7,9]

In [47]:
# b =[8,16,4,14,18]

b = []
for i in a:
    b.append(i*2)
b

[8, 16, 4, 14, 18]

In [48]:
# comprehension

b= [i*2 for i in a]
b

[8, 16, 4, 14, 18]

In [49]:
item_cols=['movie_id','title']+[str(i) for i in range(22)]

In [50]:
# Read the other file
df1 = pd.read_csv('u.item',sep='|',names = item_cols,
                  encoding='ISO-8859-1')[['movie_id','title']]

In [51]:
df1.shape

(1682, 2)

In [52]:
## Exploratory data analysis(EDA)

In [53]:
df.head()

   user_id  movie_id  rating         ts
0        0        50       5  881250949
1        0       172       5  881250949
2        0       133       1  881250949
3      196       242       3  881250949
4      186       302       3  891717742

In [54]:
df.sample(5)

       user_id  movie_id  rating         ts
53339      659       649       3  891386307
77070      900       186       2  877833957
24208      180       186       4  877127189
1414       180      1119       3  877128156
75157      521       550       3  885253844

In [55]:
df1.sample(3)

      movie_id                  title
272        273            Heat (1995)
802        803  Heaven & Earth (1993)
1243      1244           Metro (1997)

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100003 entries, 0 to 100002
Data columns (total 4 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   user_id   100003 non-null  int64
 1   movie_id  100003 non-null  int64
 2   rating    100003 non-null  int64
 3   ts        100003 non-null  int64
dtypes: int64(4)
memory usage: 3.1 MB

In [57]:
df.describe()

             user_id       movie_id         rating            ts
count  100003.000000  100003.000000  100003.000000  1.000030e+05
mean      462.470876     425.520914       3.529864  8.835288e+08
std       266.622454     330.797791       1.125704  5.343791e+06
min         0.000000       1.000000       1.000000  8.747247e+08
25%       254.000000     175.000000       3.000000  8.794487e+08
50%       447.000000     322.000000       4.000000  8.828269e+08
75%       682.000000     631.000000       4.000000  8.882600e+08
max       943.000000    1682.000000       5.000000  8.932866e+08

In [58]:
df.describe(include='all')

             user_id       movie_id         rating            ts
count  100003.000000  100003.000000  100003.000000  1.000030e+05
mean      462.470876     425.520914       3.529864  8.835288e+08
std       266.622454     330.797791       1.125704  5.343791e+06
min         0.000000       1.000000       1.000000  8.747247e+08
25%       254.000000     175.000000       3.000000  8.794487e+08
50%       447.000000     322.000000       4.000000  8.828269e+08
75%       682.000000     631.000000       4.000000  8.882600e+08
max       943.000000    1682.000000       5.000000  8.932866e+08

Try to find different Data 
1. Strings with Categorical info
2. Strings with random stuff
3. Numbers with Quantified info
4. Numbers with Categorical info
5. Random numbers or ID sort of data

In [59]:
df.columns

Index(['user_id', 'movie_id', 'rating', 'ts'], dtype='object')

In [60]:
df['rating'].unique()

array([5, 1, 3, 2, 4], dtype=int64)

In [61]:
df['rating'].nunique()

5

In [62]:
df['user_id'].nunique()

944

In [63]:
df['movie_id'].nunique()

1682

In [64]:
# merging dataframes

In [65]:
movie = pd.merge(df,df1, on='movie_id')

In [66]:
movie.head()

   user_id  movie_id  rating         ts             title
0        0        50       5  881250949  Star Wars (1977)
1      290        50       5  880473582  Star Wars (1977)
2       79        50       4  891271545  Star Wars (1977)
3        2        50       5  888552084  Star Wars (1977)
4        8        50       5  879362124  Star Wars (1977)

In [67]:
#remove reduntant or useless column ie ts
movie.drop('ts',axis=1,inplace=True)

In [68]:
movie.columns

Index(['user_id', 'movie_id', 'rating', 'title'], dtype='object')

In [69]:
# find the number of ratings for each movie
movie['title'].value_counts().head(10)

Star Wars (1977)                 584
Contact (1997)                   509
Fargo (1996)                     508
Return of the Jedi (1983)        507
Liar Liar (1997)                 485
English Patient, The (1996)      481
Scream (1996)                    478
Toy Story (1995)                 452
Air Force One (1997)             431
Independence Day (ID4) (1996)    429
Name: title, dtype: int64

In [70]:
# find the average rating for each movie
ratings =pd.DataFrame(movie.groupby('title')['rating'].mean().sort_values(ascending=False))

In [71]:
ratings['count']=movie['title'].value_counts()

In [72]:
ratings.head(20)

                                                      rating  count
title
They Made Me a Criminal (1939)                      5.000000      1
Marlene Dietrich: Shadow and Light (1996)           5.000000      1
Saint of Fort Washington, The (1993)                5.000000      2
Someone Else's America (1995)                       5.000000      1
Star Kid (1997)                                     5.000000      3
Great Day in Harlem, A (1994)                       5.000000      1
Aiqing wansui (1994)                                5.000000      1
Santa with Muscles (1996)                           5.000000      2
Prefontaine (1997)                                  5.000000      3
Entertaining Angels: The Dorothy Day Story (1996)   5.000000      1
Pather Panchali (1955)                              4.625000      8
Some Mother's Son (1996)                            4.500000      2
Maya Lin: A Strong Clear Vision (1994)              4.500000      4
Anna (1996)                                         4.500000      2
Everest (1998)                                      4.500000      2
Close Shave, A (1995)                               4.491071    112
Schindler's List (1993)                             4.466443    298
Wrong Trousers, The (1993)                          4.466102    118
Casablanca (1942)                                   4.456790    243
Wallace & Gromit: The Best of Aardman Animation...  4.447761     67

In [73]:
ratings.sort_values(by='count',ascending=False).head(20)

                                    rating  count
title
Star Wars (1977)                  4.359589    584
Contact (1997)                    3.803536    509
Fargo (1996)                      4.155512    508
Return of the Jedi (1983)         4.007890    507
Liar Liar (1997)                  3.156701    485
English Patient, The (1996)       3.656965    481
Scream (1996)                     3.441423    478
Toy Story (1995)                  3.878319    452
Air Force One (1997)              3.631090    431
Independence Day (ID4) (1996)     3.438228    429
Raiders of the Lost Ark (1981)    4.252381    420
Godfather, The (1972)             4.283293    413
Pulp Fiction (1994)               4.060914    394
Twelve Monkeys (1995)             3.798469    392
Silence of the Lambs, The (1991)  4.289744    390
Jerry Maguire (1996)              3.710938    384
Chasing Amy (1997)                3.839050    379
Rock, The (1996)                  3.693122    378
Empire Strikes Back, The (1980)   4.206522    368
Star Trek: First Contact (1996)   3.660274    365

In [74]:
movie_pivot = movie.pivot_table(index='user_id',columns='title',values='rating')
movie_pivot.head()

title,'Til There Was You (1997),1-900 (1994),101 Dalmatians (1996),12 Angry Men (1957),187 (1997),2 Days in the Valley (1996),"20,000 Leagues Under the Sea (1954)",2001: A Space Odyssey (1968),3 Ninjas: High Noon At Mega Mountain (1998),"39 Steps, The (1935)",...,Yankee Zulu (1994),Year of the Horse (1997),You So Crazy (1994),Young Frankenstein (1974),Young Guns (1988),Young Guns II (1990),"Young Poisoner's Handbook, The (1995)",Zeus and Roxanne (1997),unknown,Á köldum klaka (Cold Fever) (1994)
user_id,,,,,,,,,,,,,,,,,,,,,
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,2.0,5.0,NaN,NaN,3.0,4.0,NaN,NaN,...,NaN,NaN,NaN,5.0,3.0,NaN,NaN,NaN,4.0,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,2.0,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

# correlation

In [75]:
movie_selected='Star Wars (1977)'

In [76]:
ms_rates = movie_pivot[movie_selected]
ms_rates.head()

user_id
0    5.0
1    5.0
2    5.0
3    NaN
4    5.0
Name: Star Wars (1977), dtype: float64

In [77]:
import warnings
warnings.filterwarnings('ignore')

In [78]:
corrs = movie_pivot.corrwith(ms_rates)
corrs.head(20)

title
'Til There Was You (1997)                      0.872872
1-900 (1994)                                  -0.645497
101 Dalmatians (1996)                          0.211132
12 Angry Men (1957)                            0.184289
187 (1997)                                     0.027398
2 Days in the Valley (1996)                    0.066654
20,000 Leagues Under the Sea (1954)            0.289768
2001: A Space Odyssey (1968)                   0.230884
3 Ninjas: High Noon At Mega Mountain (1998)         NaN
39 Steps, The (1935)                           0.106453
8 1/2 (1963)                                  -0.142977
8 Heads in a Duffel Bag (1997)                -0.577350
8 Seconds (1994)                              -0.755929
A Chef in Love (1996)                          0.868599
Above the Rim (1994)                          -0.645497
Absolute Power (1997)                          0.085440
Abyss, The (1989)                              0.203709
Ace Ventura: Pet Detective (1994)              0.062689
Ace Ventura: When Nature Calls (1995)          0.094514
Across the Sea of Time (1995)                 -0.132453
dtype: float64

In [79]:
corrs.sort_values(ascending=False).head(8)

title
Hollow Reed (1996)                   1.0
Commandments (1997)                  1.0
Cosi (1996)                          1.0
No Escape (1994)                     1.0
Stripes (1981)                       1.0
Star Wars (1977)                     1.0
Man of the Year (1995)               1.0
Beans of Egypt, Maine, The (1994)    1.0
dtype: float64

In [80]:
corrs_df = pd.DataFrame(corrs,columns=['Correlation'])
corrs_df.head()

                           Correlation
title
'Til There Was You (1997)     0.872872
1-900 (1994)                 -0.645497
101 Dalmatians (1996)         0.211132
12 Angry Men (1957)           0.184289
187 (1997)                    0.027398

In [81]:
corrs_df['rating']= ratings['rating']
corrs_df['count']= ratings['count']

In [82]:
corrs_df.head()

                           Correlation    rating  count
title
'Til There Was You (1997)     0.872872  2.333333      9
1-900 (1994)                 -0.645497  2.600000      5
101 Dalmatians (1996)         0.211132  2.908257    109
12 Angry Men (1957)           0.184289  4.344000    125
187 (1997)                    0.027398  3.024390     41

In [83]:
corrs_df[corrs_df['count']>50].sort_values(by='Correlation',ascending=False).head(10)

,Correlation,rating,count
title,,,
Star Wars (1977),1.000000,4.359589,584
"Empire Strikes Back, The (1980)",0.748353,4.206522,368
Return of the Jedi (1983),0.672556,4.007890,507
Raiders of the Lost Ark (1981),0.536117,4.252381,420
Giant (1956),0.488093,3.745098,51
"Life Less Ordinary, A (1997)",0.411638,3.075472,53
Austin Powers: International Man of Mystery (1997),0.377433,3.246154,130
"Sting, The (1973)",0.367538,4.058091,241
Indiana Jones and the Last Crusade (1989),0.350107,3.930514,331
Pinocchio (1940),0.347868,3.673267,101

In [86]:
top_3_r =list(corrs_df[corrs_df['count']>50].sort_values(by='Correlation',ascending=False).head(3).index)

In [87]:
top_3_r.remove(movie_selected)

In [88]:
top_recom

['Star Wars (1977)',
 'Empire Strikes Back, The (1980)',
 'Return of the Jedi (1983)']

In [89]:
movie_selected

'Star Wars (1977)'

In [ ]:
import pandas as pd
import warnings
warnings.filterwarnings('ignore')


def movie_reccomend(movie_selected ='Star Wars (1977)' ):
    #Read Files
    cols = ['user_id','movie_id','rating','ts']
    df = pd.read_csv('u.data',sep='\t',names=cols).drop('ts',axis=1)
    item_cols=['movie_id','title']+[str(i) for i in range(22)]
    df1 = pd.read_csv('u.item',sep='|',names = item_cols,encoding='ISO-8859-1')[['movie_id','title']]
    
    #Merge the Dataframes
    movie = pd.merge(df,df1, on='movie_id')
    
    #Create pivot table
    movie_pivot = movie.pivot_table(index='user_id',columns='title',values='rating')
    
    #Find Similarity for Selected Movie
    corrs = movie_pivot.corrswith(movie_pivot[movie_selected])
    corrs_df=pd.DataFrame(corrs,column=['Correlation'])
    corrs_df['rating']=movie.groupby('title')['rating'].mean()
    corrs_df['count']=movie['title'].value_counts()